Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64MU202.h
/* RPINR22 */
#define _SDI2R RPINR22bits.SDI2R
#define _SCK2INR RPINR22bits.SCK2INR
#define _SDI2R0 RPINR22bits.SDI2R0
#define _SDI2R1 RPINR22bits.SDI2R1
#define _SDI2R2 RPINR22bits.SDI2R2
#define _SDI2R3 RPINR22bits.SDI2R3
#define _SDI2R4 RPINR22bits.SDI2R4
#define _SDI2R5 RPINR22bits.SDI2R5
#define _SDI2R6 RPINR22bits.SDI2R6
#define _SCK2INR0 RPINR22bits.SCK2INR0
#define _SCK2INR1 RPINR22bits.SCK2INR1
#define _SCK2INR2 RPINR22bits.SCK2INR2
#define _SCK2INR3 RPINR22bits.SCK2INR3
#define _SCK2INR4 RPINR22bits.SCK2INR4
#define _SCK2INR5 RPINR22bits.SCK2INR5
#define _SCK2INR6 RPINR22bits.SCK2INR6

/* RPINR23 */
#define _SS2R RPINR23bits.SS2R
#define _SS2R0 RPINR23bits.SS2R0
#define _SS2R1 RPINR23bits.SS2R1
#define _SS2R2 RPINR23bits.SS2R2
#define _SS2R3 RPINR23bits.SS2R3
#define _SS2R4 RPINR23bits.SS2R4
#define _SS2R5 RPINR23bits.SS2R5
#define _SS2R6 RPINR23bits.SS2R6

/* RPINR24 */
#define _CSDIR RPINR24bits.CSDIR
#define _CSCKR RPINR24bits.CSCKR
#define _CSDIR0 RPINR24bits.CSDIR0
#define _CSDIR1 RPINR24bits.CSDIR1
#define _CSDIR2 RPINR24bits.CSDIR2
#define _CSDIR3 RPINR24bits.CSDIR3
#define _CSDIR4 RPINR24bits.CSDIR4
#define _CSDIR5 RPINR24bits.CSDIR5
#define _CSDIR6 RPINR24bits.CSDIR6
#define _CSCKR0 RPINR24bits.CSCKR0
#define _CSCKR1 RPINR24bits.CSCKR1
#define _CSCKR2 RPINR24bits.CSCKR2
#define _CSCKR3 RPINR24bits.CSCKR3
#define _CSCKR4 RPINR24bits.CSCKR4
#define _CSCKR5 RPINR24bits.CSCKR5
#define _CSCKR6 RPINR24bits.CSCKR6

/* RPINR25 */
#define _COFSR RPINR25bits.COFSR
#define _COFSR0 RPINR25bits.COFSR0
#define _COFSR1 RPINR25bits.COFSR1
#define _COFSR2 RPINR25bits.COFSR2
#define _COFSR3 RPINR25bits.COFSR3
#define _COFSR4 RPINR25bits.COFSR4
#define _COFSR5 RPINR25bits.COFSR5
#define _COFSR6 RPINR25bits.COFSR6

/* RPINR26 */
#define _C1RXR RPINR26bits.C1RXR
#define _C1RXR0 RPINR26bits.C1RXR0
#define _C1RXR1 RPINR26bits.C1RXR1
#define _C1RXR2 RPINR26bits.C1RXR2
#define _C1RXR3 RPINR26bits.C1RXR3
#define _C1RXR4 RPINR26bits.C1RXR4
#define _C1RXR5 RPINR26bits.C1RXR5
#define _C1RXR6 RPINR26bits.C1RXR6

/* RPINR27 */
#define _U3RXR RPINR27bits.U3RXR
#define _U3CTSR RPINR27bits.U3CTSR
#define _U3RXR0 RPINR27bits.U3RXR0
#define _U3RXR1 RPINR27bits.U3RXR1
#define _U3RXR2 RPINR27bits.U3RXR2
#define _U3RXR3 RPINR27bits.U3RXR3
#define _U3RXR4 RPINR27bits.U3RXR4
#define _U3RXR5 RPINR27bits.U3RXR5
#define _U3RXR6 RPINR27bits.U3RXR6
#define _U3CTSR0 RPINR27bits.U3CTSR0
#define _U3CTSR1 RPINR27bits.U3CTSR1
#define _U3CTSR2 RPINR27bits.U3CTSR2
#define _U3CTSR3 RPINR27bits.U3CTSR3
#define _U3CTSR4 RPINR27bits.U3CTSR4
#define _U3CTSR5 RPINR27bits.U3CTSR5
#define _U3CTSR6 RPINR27bits.U3CTSR6

/* RPINR28 */
#define _U4RXR RPINR28bits.U4RXR
#define _U4CTSR RPINR28bits.U4CTSR
#define _U4RXR0 RPINR28bits.U4RXR0
#define _U4RXR1 RPINR28bits.U4RXR1
#define _U4RXR2 RPINR28bits.U4RXR2
#define _U4RXR3 RPINR28bits.U4RXR3
#define _U4RXR4 RPINR28bits.U4RXR4
#define _U4RXR5 RPINR28bits.U4RXR5
#define _U4RXR6 RPINR28bits.U4RXR6
#define _U4CTSR0 RPINR28bits.U4CTSR0
#define _U4CTSR1 RPINR28bits.U4CTSR1
#define _U4CTSR2 RPINR28bits.U4CTSR2
#define _U4CTSR3 RPINR28bits.U4CTSR3
#define _U4CTSR4 RPINR28bits.U4CTSR4
#define _U4CTSR5 RPINR28bits.U4CTSR5
#define _U4CTSR6 RPINR28bits.U4CTSR6

/* RPINR29 */
#define _SDI3R RPINR29bits.SDI3R
#define _SCK3R RPINR29bits.SCK3R
#define _SDI3R0 RPINR29bits.SDI3R0
#define _SDI3R1 RPINR29bits.SDI3R1
#define _SDI3R2 RPINR29bits.SDI3R2
#define _SDI3R3 RPINR29bits.SDI3R3
#define _SDI3R4 RPINR29bits.SDI3R4
#define _SDI3R5 RPINR29bits.SDI3R5
#define _SDI3R6 RPINR29bits.SDI3R6
#define _SCK3R0 RPINR29bits.SCK3R0
#define _SCK3R1 RPINR29bits.SCK3R1
#define _SCK3R2 RPINR29bits.SCK3R2
#define _SCK3R3 RPINR29bits.SCK3R3
#define _SCK3R4 RPINR29bits.SCK3R4
#define _SCK3R5 RPINR29bits.SCK3R5
#define _SCK3R6 RPINR29bits.SCK3R6

/* RPINR30 */
#define _SS3R RPINR30bits.SS3R
#define _SS3R0 RPINR30bits.SS3R0
#define _SS3R1 RPINR30bits.SS3R1
#define _SS3R2 RPINR30bits.SS3R2
#define _SS3R3 RPINR30bits.SS3R3
#define _SS3R4 RPINR30bits.SS3R4
#define _SS3R5 RPINR30bits.SS3R5
#define _SS3R6 RPINR30bits.SS3R6

/* RPINR37 */
#define _SYNCI1R RPINR37bits.SYNCI1R
#define _SYNCI1R0 RPINR37bits.SYNCI1R0
#define _SYNCI1R1 RPINR37bits.SYNCI1R1
#define _SYNCI1R2 RPINR37bits.SYNCI1R2
#define _SYNCI1R3 RPINR37bits.SYNCI1R3
#define _SYNCI1R4 RPINR37bits.SYNCI1R4
#define _SYNCI1R5 RPINR37bits.SYNCI1R5
#define _SYNCI1R6 RPINR37bits.SYNCI1R6

/* RPINR38 */
#define _SYNCI2R RPINR38bits.SYNCI2R
#define _DTCMP1R RPINR38bits.DTCMP1R
#define _SYNCI2R0 RPINR38bits.SYNCI2R0
#define _SYNCI2R1 RPINR38bits.SYNCI2R1
#define _SYNCI2R2 RPINR38bits.SYNCI2R2
#define _SYNCI2R3 RPINR38bits.SYNCI2R3
#define _SYNCI2R4 RPINR38bits.SYNCI2R4
#define _SYNCI2R5 RPINR38bits.SYNCI2R5
#define _SYNCI2R6 RPINR38bits.SYNCI2R6
#define _DTCMP1R0 RPINR38bits.DTCMP1R0
#define _DTCMP1R1 RPINR38bits.DTCMP1R1
#define _DTCMP1R2 RPINR38bits.DTCMP1R2
#define _DTCMP1R3 RPINR38bits.DTCMP1R3
#define _DTCMP1R4 RPINR38bits.DTCMP1R4
#define _DTCMP1R5 RPINR38bits.DTCMP1R5
#define _DTCMP1R6 RPINR38bits.DTCMP1R6

/* RPINR39 */
#define _DTCMP2R RPINR39bits.DTCMP2R
#define _DTCMP3R RPINR39bits.DTCMP3R
#define _DTCMP2R0 RPINR39bits.DTCMP2R0
#define _DTCMP2R1 RPINR39bits.DTCMP2R1
#define _DTCMP2R2 RPINR39bits.DTCMP2R2
#define _DTCMP2R3 RPINR39bits.DTCMP2R3
#define _DTCMP2R4 RPINR39bits.DTCMP2R4
#define _DTCMP2R5 RPINR39bits.DTCMP2R5
#define _DTCMP2R6 RPINR39bits.DTCMP2R6
#define _DTCMP3R0 RPINR39bits.DTCMP3R0
#define _DTCMP3R1 RPINR39bits.DTCMP3R1
#define _DTCMP3R2 RPINR39bits.DTCMP3R2
#define _DTCMP3R3 RPINR39bits.DTCMP3R3
#define _DTCMP3R4 RPINR39bits.DTCMP3R4
#define _DTCMP3R5 RPINR39bits.DTCMP3R5
#define _DTCMP3R6 RPINR39bits.DTCMP3R6

/* RPINR40 */
#define _DTCMP4R RPINR40bits.DTCMP4R
#define _DTCMP5R RPINR40bits.DTCMP5R
#define _DTCMP4R0 RPINR40bits.DTCMP4R0
#define _DTCMP4R1 RPINR40bits.DTCMP4R1
#define _DTCMP4R2 RPINR40bits.DTCMP4R2
#define _DTCMP4R3 RPINR40bits.DTCMP4R3
#define _DTCMP4R4 RPINR40bits.DTCMP4R4
#define _DTCMP4R5 RPINR40bits.DTCMP4R5
#define _DTCMP4R6 RPINR40bits.DTCMP4R6
#define _DTCMP5R0 RPINR40bits.DTCMP5R0
#define _DTCMP5R1 RPINR40bits.DTCMP5R1
#define _DTCMP5R2 RPINR40bits.DTCMP5R2
#define _DTCMP5R3 RPINR40bits.DTCMP5R3
#define _DTCMP5R4 RPINR40bits.DTCMP5R4
#define _DTCMP5R5 RPINR40bits.DTCMP5R5
#define _DTCMP5R6 RPINR40bits.DTCMP5R6

/* RPINR41 */
#define _DTCMP6R RPINR41bits.DTCMP6R
#define _DTCMP6R0 RPINR41bits.DTCMP6R0
#define _DTCMP6R1 RPINR41bits.DTCMP6R1
#define _DTCMP6R2 RPINR41bits.DTCMP6R2
#define _DTCMP6R3 RPINR41bits.DTCMP6R3
#define _DTCMP6R4 RPINR41bits.DTCMP6R4
#define _DTCMP6R5 RPINR41bits.DTCMP6R5
#define _DTCMP6R6 RPINR41bits.DTCMP6R6

/* DFCON */
#define _DFCMD DFCONbits.DFCMD
#define _DFIPE DFCONbits.DFIPE
#define _DFERR DFCONbits.DFERR
#define _DFWREN DFCONbits.DFWREN
#define _DFST DFCONbits.DFST
#define _DFIDL DFCONbits.DFIDL
#define _DFRDY DFCONbits.DFRDY
#define _DFEN DFCONbits.DFEN
#define _DFCMD0 DFCONbits.DFCMD0
#define _DFCMD1 DFCONbits.DFCMD1
#define _DFERR0 DFCONbits.DFERR0
#define _DFERR1 DFCONbits.DFERR1

/* DFADDR */
#define _DFADDR DFADDRbits.DFADDR

/* NVMCON */
#define _NVMOP NVMCONbits.NVMOP
#define _URERR NVMCONbits.URERR
#define _RPDF NVMCONbits.RPDF
#define _NVMSIDL NVMCONbits.NVMSIDL
#define _WRERR NVMCONbits.WRERR
#define _WREN NVMCONbits.WREN
#define _WR NVMCONbits.WR
#define _NVMOP0 NVMCONbits.NVMOP0
#define _NVMOP1 NVMCONbits.NVMOP1
#define _NVMOP2 NVMCONbits.NVMOP2
#define _NVMOP3 NVMCONbits.NVMOP3

