Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP64MU202.h
/* PTGQUE0 */
#define _STEP0 PTGQUE0bits.STEP0
#define _STEP1 PTGQUE0bits.STEP1

/* PTGQUE1 */
#define _STEP2 PTGQUE1bits.STEP2
#define _STEP3 PTGQUE1bits.STEP3

/* PTGQUE2 */
#define _STEP4 PTGQUE2bits.STEP4
#define _STEP5 PTGQUE2bits.STEP5

/* PTGQUE3 */
#define _STEP6 PTGQUE3bits.STEP6
#define _STEP7 PTGQUE3bits.STEP7

/* PTGQUE4 */
#define _STEP8 PTGQUE4bits.STEP8
#define _STEP9 PTGQUE4bits.STEP9

/* PTGQUE5 */
#define _STEP10 PTGQUE5bits.STEP10
#define _STEP11 PTGQUE5bits.STEP11

/* PTGQUE6 */
#define _STEP12 PTGQUE6bits.STEP12
#define _STEP13 PTGQUE6bits.STEP13

/* PTGQUE7 */
#define _STEP14 PTGQUE7bits.STEP14
#define _STEP15 PTGQUE7bits.STEP15

/* PTGQUE8 */
#define _STEP16 PTGQUE8bits.STEP16
#define _STEP17 PTGQUE8bits.STEP17

/* PTGQUE9 */
#define _STEP18 PTGQUE9bits.STEP18
#define _STEP19 PTGQUE9bits.STEP19

/* PTGQUE10 */
#define _STEP20 PTGQUE10bits.STEP20
#define _STEP21 PTGQUE10bits.STEP21

/* PTGQUE11 */
#define _STEP22 PTGQUE11bits.STEP22
#define _STEP23 PTGQUE11bits.STEP23

/* PTGQUE12 */
#define _STEP24 PTGQUE12bits.STEP24
#define _STEP25 PTGQUE12bits.STEP25

/* PTGQUE13 */
#define _STEP26 PTGQUE13bits.STEP26
#define _STEP27 PTGQUE13bits.STEP27

/* PTGQUE14 */
#define _STEP28 PTGQUE14bits.STEP28
#define _STEP29 PTGQUE14bits.STEP29

/* PTGQUE15 */
#define _STEP30 PTGQUE15bits.STEP30
#define _STEP31 PTGQUE15bits.STEP31

/* DMA0CON */
#define _MODE DMA0CONbits.MODE
#define _AMODE DMA0CONbits.AMODE
#define _NULLW DMA0CONbits.NULLW
#define _HALF DMA0CONbits.HALF
#define _DIR DMA0CONbits.DIR
#define _SIZE DMA0CONbits.SIZE
#define _CHEN DMA0CONbits.CHEN
#define _MODE0 DMA0CONbits.MODE0
#define _MODE1 DMA0CONbits.MODE1
#define _AMODE0 DMA0CONbits.AMODE0
#define _AMODE1 DMA0CONbits.AMODE1

/* DMA0REQ */
#define _IRQSEL DMA0REQbits.IRQSEL
#define _FORCE DMA0REQbits.FORCE
#define _IRQSEL0 DMA0REQbits.IRQSEL0
#define _IRQSEL1 DMA0REQbits.IRQSEL1
#define _IRQSEL2 DMA0REQbits.IRQSEL2
#define _IRQSEL3 DMA0REQbits.IRQSEL3
#define _IRQSEL4 DMA0REQbits.IRQSEL4
#define _IRQSEL5 DMA0REQbits.IRQSEL5
#define _IRQSEL6 DMA0REQbits.IRQSEL6
#define _IRQSEL7 DMA0REQbits.IRQSEL7

/* DMA0STAH */
/* Bitname _STA cannot be defined because it is used by more than one SFR */

/* DMA0STBH */
/* Bitname _STB cannot be defined because it is used by more than one SFR */

/* DMA0CNT */
#define _CNT DMA0CNTbits.CNT

/* DMA1CON */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE cannot be defined because it is used by more than one SFR */
/* Bitname _NULLW cannot be defined because it is used by more than one SFR */
/* Bitname _HALF cannot be defined because it is used by more than one SFR */
/* Bitname _DIR cannot be defined because it is used by more than one SFR */
/* Bitname _SIZE cannot be defined because it is used by more than one SFR */
/* Bitname _CHEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE1 cannot be defined because it is used by more than one SFR */

/* DMA1REQ */
/* Bitname _IRQSEL cannot be defined because it is used by more than one SFR */
/* Bitname _FORCE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL5 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL6 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL7 cannot be defined because it is used by more than one SFR */

/* DMA1STAH */
/* Bitname _STA cannot be defined because it is used by more than one SFR */

/* DMA1STBH */
/* Bitname _STB cannot be defined because it is used by more than one SFR */

/* DMA1CNT */
/* Bitname _CNT cannot be defined because it is used by more than one SFR */

/* DMA2CON */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE cannot be defined because it is used by more than one SFR */
/* Bitname _NULLW cannot be defined because it is used by more than one SFR */
/* Bitname _HALF cannot be defined because it is used by more than one SFR */
/* Bitname _DIR cannot be defined because it is used by more than one SFR */
/* Bitname _SIZE cannot be defined because it is used by more than one SFR */
/* Bitname _CHEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE1 cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE0 cannot be defined because it is used by more than one SFR */
/* Bitname _AMODE1 cannot be defined because it is used by more than one SFR */

/* DMA2REQ */
/* Bitname _IRQSEL cannot be defined because it is used by more than one SFR */
/* Bitname _FORCE cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL2 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL3 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL4 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL5 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL6 cannot be defined because it is used by more than one SFR */
/* Bitname _IRQSEL7 cannot be defined because it is used by more than one SFR */

/* DMA2STAH */
/* Bitname _STA cannot be defined because it is used by more than one SFR */

/* DMA2STBH */
/* Bitname _STB cannot be defined because it is used by more than one SFR */

